[
  {
    "title": "There's More to Open Source than Code ",
    "abstract": "Interested in trying out OSS contributing, and can't find a project you're comfortable in? Maybe you found an issue but the scope is too big to start?\r\n\r\nThere are other ways to get into OSS! In this chat, we'll cover non-code contributions, the different types there is, and how to get started in a way that works for you.",
    "format": "Talk",
    "track": "Open Toolbox",
    "tags": [],
    "id": 32,
    "video_url": null,
    "slides_url": null,
    "speakers": [
      {
        "name": "Ramón Huidobro",
        "bio": "Ramón is a software engineering and developer relations contractor based in Vienna, Austria. He's spent the last ten years being directly involved with small businesses and startups getting their apps off the ground or back in shape!\r\n\r\nHis main motivation is community. He's not only actively worked software builders both new and experienced, but also dedicated a time to organising conferences, workshops and other events aimed at helping empower folks in their tech journey.\r\n"
      }
    ]
  },
  {
    "title": "Accessibility in Design",
    "abstract": "As a designer, you have the power and responsibility to make sure that everyone has access to what you create regardless of ability, context, or situation. \r\nHow can you create not only beautiful designs but also ones that can speak and be well understood by a wide range of users?  This session will cover what is accessibility and you can intentionally ensure your designs are accessible and inclusive.",
    "format": "Talk",
    "track": "Beyond the Binary",
    "tags": [],
    "id": 22,
    "video_url": null,
    "slides_url": null,
    "speakers": [
      {
        "name": "Bethany Jepchumba",
        "bio": "Bethany Jepchumba - My mantra is recreating stories, enhancing experiences! I aim to improve experiences whether it is through design, code, or leadership. Currently, I am a Program Coordinator at Andela and a Microsoft Certified Trainer. Formerly, I was a Gold Microsoft Learn Student Ambassador."
      }
    ]
  },
  {
    "title": "A Primer on Open Source Licensing",
    "abstract": "In this talk, I'll give a brief introduction to copyright and license then I'll be speaking about what makes a project Open-Source and what doesn't. The major part will revolve around explaining the available open-source licenses, their importance, and how people who are new to open-source can choose the best license for their projects.",
    "format": "Talk",
    "track": "Tech \u0026 Ethics",
    "tags": [],
    "id": 23,
    "video_url": "",
    "slides_url": "",
    "speakers": [
      {
        "name": "Shubhendra Singh Chauhan",
        "bio": "Developer Advocate 🥑 | Open Source 💖"
      }
    ]
  },
  {
    "title": "I Think, Therefore I Code: An Introduction to Pseudocode",
    "abstract": "I think therefore I code it's an introduction to pseudocode as a way to solve problems and start writing algorithms even if we don't know the coding language this algorithms will be written.  \r\nDuring the talk I will cover the main aspects of an algorithm and what an algorithm actually is. Share code samples of how we can apply pseudocode, and the benefits of it\r\nAt the end of the talk I would love every attendee to feel like this is a tool that will help them to tackle some insecurities and to crumble huge problems in little tasks that they can in the future translate into any coding language",
    "format": "Talk",
    "track": "None",
    "tags": [],
    "id": 25,
    "video_url": "",
    "slides_url": "",
    "speakers": [
      {
        "name": "Silvia España Gil",
        "bio": "Once a marketer, then a frontender and now a junior iOS mobile developer I found in pseudocode a way to solve coding problems without a single line of code.  I think therefore I code is a reminder that we can solve problems and later on, actually code them."
      }
    ]
  },
  {
    "title": "Celibrate you're misteaks",
    "abstract": "\"Everyone makes mistakes.\" We've heard it time and again. But there's always that nagging voice inside our heads telling us to hide it away somewhere. But why be ashamed?! Besides, this can lead to more mistakes in the future. We'll take a look at some of my mistakes and even look at some extreme cases where mistakes can cost lives.\r\n\r\nAs well as looking at how hiding mistakes can be damaging to our confidence as well as to our work, we'll discuss how and when to talk about our mistakes along with success stories and how highlighting past mistakes can help save time, effort, and - most importantly - shame as individuals, teams, and as a community.",
    "format": "Talk",
    "track": "Healthy Coding",
    "tags": [],
    "id": 26,
    "video_url": null,
    "slides_url": null,
    "speakers": [
      {
        "name": "Joe Glombek",
        "bio": "Joe is a senior .NET web developer who's been working with various British digital agencies for the past decade and is an Umbraco MVP. But in the 5-to-9 he is an adventure-loving outdoorsman and can often be seen out hiking or canoeing with his dog, Carter."
      }
    ]
  },
  {
    "title": "A Programmer's Guide to Mental Health",
    "abstract": "I experienced burnout for the first time just within two years into my career as a software developer. If I could go back in time, and tell myself one thing, it would be “it’s okay not to be okay”.\r\n\r\nStarting your first software development job is very rewarding. You get to apply what you learned from school, bootcamp, or self-learning to a product used by actual customers. At the same time, there are lots of opportunities to learn and grow.\r\n\r\nWhen I started my first job, I didn’t have much experience, I felt like a complete imposter. You could say it’s like being in a foggy place and defogging as you go, trying to prove you know your way around. I felt like any questions asked or any feedback given, could expose me as an imposter. It made saying \"I don't know” hard.\r\n\r\nA few months in, my lead went on their paternity leave, and my director left the company. I didn’t have anyone I could go to for support or guidance. I developed a few bad habits like comparing myself to others, and spending my off-time working. It was very unhealthy, and it led me to burning out. Some days, I would feel awesome, and other days, I would feel sad.\r\n\r\nNow with more years of experience under my belt, and being a mentor to others. This talk will cover how I burned out, strategies on how I take care of myself now, and why it's okay not to be okay.\r\n\r\nIn my talk, I will cover the following topics:\r\n- Dealing with imposter syndrome\r\n- Signs of burnout\r\n- Not giving yourself a break\r\n- Taking on more than you can handle\r\n- How to take care of yourself (personal boundaries)\r\n- Organizing your day, and setting core hours\r\n- Setting a goal on how to get better 1% a day.\r\n- Asking for constructive feedback\r\n- Starting a brag list to capture weekly wins!\r\n- Have social chats with others!\r\n- Support and guidance\r\n- It’s okay to say I don’t know\r\n\r\nImposter Syndrome is completely normal to have. As we gain more experience or change roles,  it definitely won’t be going away. We can reduce it, and accept it as a sign we are learning new things and growing. This is where my talk will focus on the strategies I used to reduce imposter syndrome. One of the key strategies I used is setting a 1% increment to be better daily. For example, am I getting less comments on my pull request? Or can I provide others context on how something I work on works? As well, by sharing how I structure my 1:1s with my lead, and interns to know how I am doing. I will also introduce rituals that I started in late 2020, which are capturing weekly wins, and daily positive affirmations. These rituals help me realize that I am growing, and allow me to reflect back to my accomplishments.\r\n\r\nAfter, my talk will move onto signs to look out for with burnout. I talked about how I burned out, and how I did not realize I was burning out until it was too late. I will share my strategies on how I do self-care such as having social chats, and setting core hours to prevent overworking.\r\n\r\nBy the end of my talk, I want the audience to walk away with strategies I used when dealing with burning out and imposter syndrome. This is definitely a difficult thing to talk to others with, but by sharing my story, I want to open up and let others know, it’s okay. This is all part of being 1% better a day that focuses on the process rather than the end goal.",
    "format": "Talk",
    "track": "Healthy Coding",
    "tags": [],
    "id": 27,
    "video_url": "",
    "slides_url": "",
    "speakers": [
      {
        "name": "Raymond Chung",
        "bio": "Often mistaken as an intern, Raymond Chung is building a new generation of software developers through Shopify's Dev Degree program. As a Technical Educator, his passion for computer science and education allows him to create bite-sized content that engages interns throughout their day-to-day. When he is not teaching, you'll find Raymond exploring for the best bubble tea shop."
      }
    ]
  },
  {
    "title": "Women and tech: Why representation matters",
    "abstract": "It's no secret: the percentage of women and non-binary people in technology is much lower than that of men. And that number drops even more in leadership positions.\r\n\r\nIn this lecture, we will talk about representation: What is it? Why does it matter?\r\n\r\nHow this literally changes the lives of the people involved and how you, who are not women, can support and help with actions and not just posts on Twitter.",
    "format": "Talk",
    "track": "Beyond the Binary",
    "tags": [],
    "id": 28,
    "video_url": null,
    "slides_url": null,
    "speakers": [
      {
        "name": "Pachi",
        "bio": "Pachi is your friendly developer relations person.\r\nAfter nannying for years, she started learning to code while building meaningful connections within the dev community.\r\nA native Brazilian, Pachi infuses her experience as an immigrant woman in tech into her work.  Her goa is to create newbie-friendly content to help make tech should be accessible to all.\r\nWhen she's not live coding on Twitch, Pachi watches anime, reads too many romance novels and complains about Patriarchy on twitter. "
      }
    ]
  },
  {
    "title": "Design Systems for Developers",
    "abstract": "If you're a developer who's going to work with designers, then chances are high that at some point you'll be presented with a design system. Understanding your way around that system will improve your understanding of how designs and prototypes are meant to be translated into code as well as making your life easier by providing quick access to resources. A lot of devs hear the word \"design\" and immediately tune out, but that's a mistake! Learn what's in a design system, how they improve design/dev collaboration, and how you can get the most out of this resource. ",
    "format": "Talk",
    "track": "None",
    "tags": [],
    "id": 30,
    "video_url": null,
    "slides_url": null,
    "speakers": [
      {
        "name": "Kathryn Grayson Nanz",
        "bio": "In 2013, I graduated with a BFA and took my first job as Junior Graphic Designer at a small ad agency. While there, my Creative Director warned me to never let anyone find out I could code, because if I did I'd be stuck doing it forever. I ignored his warning; it turns out he was 100% right, but I've never been happier. I currently work as a dev advocate on a great team where I help people build web apps in React, design and maintain component libraries, and stop back-end devs from writing CSS."
      }
    ]
  },
  {
    "title": "Teaching through Code Review",
    "abstract": "Code reviews are often focused solely on quality control. The reviewer protecting their main git branch from badly formatted, not properly tested code that can introduce bugs. Code reviews become adversarial processes where the requester must meet all the demands of the reviewer. This type of process does not promote teamwork nor does it allow less experienced engineers the opportunity to truly learn.\r\n\r\nIn this talk we will learn a new approach to code review. We will learn how to make code review a learning experience by transforming the role of reviewer into a teacher. This approach can lead to high quality code, developer satisfaction and team building. We will also explore ways that junior developers can make changes in the process and encourage adoption of better review practiced by senior and lead developers. By the end of this talk you will learn how to make code review a great learning experience for all those involved.",
    "format": "Talk",
    "track": "Healthy Coding",
    "tags": [],
    "id": 34,
    "video_url": null,
    "slides_url": null,
    "speakers": [
      {
        "name": "Derek Binkley 🇺🇦",
        "bio": "Derek Binkley is a Full Stack Engineer with Localize. While getting his start fixing the Y2K date problem in Cobol, Derek quickly moved on to spend over twenty years using JavaScript, PHP, JVM Languages, and SQL and NoSQL databases.\r\n\r\nHe enjoys teaching others through speaking, mentoring, and writing articles. Derek encourages developers to write clean, testable code. When not in front of a computer he spends time with family, travels, makes pizza, and drinks beer."
      }
    ]
  },
  {
    "title": "Next-Gen Inclusivity: How Gen Z Can Make Real Change in Tech",
    "abstract": "In this talk, we will come across how early-career developers can help create a culture of diversity and inclusion in their teams. We will talk about some ways that can help us beat the age-old bias, and also cite some real-life examples.\r\nBeing an early-career developer myself, I have seen that a large part of the industry is still occupied by people who aren’t open to change and do not agree with “Gen Z”. Let’s prove that Gen-Z is more than cool lingo and social media butterflies. Taking the first step is difficult and we can do this by just speaking out loud about our problems and grievances - chances are in a room of 100, only 2 will listen, but even that is a step ahead from zero and can address our problem.",
    "format": "Talk",
    "track": "Beyond the Binary",
    "tags": [],
    "id": 29,
    "video_url": "",
    "slides_url": "",
    "speakers": [
      {
        "name": "Haimantika Mitra",
        "bio": "Haimantika Mitra is a Developer Relations Engineer at Appwrite. She is a community builder and a product of the community herself. She believes that technology is for everyone and is heavily involved in learning, sharing, and building with the community. So far, she has helped over 1000 students in the BAME community with mentoring and improving their technical skills. Being a huge advocate of women in tech, she has helped women early in their careers find a way to tech. "
      }
    ]
  },
  {
    "title": "The Shared Responsibility of Tech Ethics",
    "abstract": "OVERVIEW\r\n- The current landscape of technological innovation as it relates to human connection.\r\n- The failed attempts of automated + computerized moderation\r\n- Is the medium the message? Can we ever combine technology and connection, ethically?\r\n- Reflecting on the role of the individual in technical environments.\r\n\r\nTHE POWER OF THE INDIVIDUAL\r\n- Every institution, organization, or community is made up of individuals\r\n- We often pin failures on individuals: but what would happen if we took a proactive stance?\r\n- What does taking a proactive stance as an individual look like?\r\n- How can we foster this in communal spaces?\r\n\r\nTHE INDIVIDUALS CONTRIBUTION TO THE COMMUNAL\r\n- Individual impacts on team/organizational culture \r\n- This has both good and bad impacts\r\n- Why organizations should look for strong individual ethics\r\n- How to cultivate a culture of individual contribution\r\n- Why I’m optimistic about how this could change the entire industry.\r\n\r\nTakeaways:\r\n- Why someone should create their own code of ethics, proactively\r\n- How organizations can build trust by embracing individuals as they are.\r\n- How you can foster trusted collaborative cultures in asynchronous, technical environments.\r\n",
    "format": "Talk",
    "track": "Tech \u0026 Ethics",
    "tags": [],
    "id": 24,
    "video_url": "",
    "slides_url": "",
    "speakers": [
      {
        "name": "Erin Mikail Staples ",
        "bio": "Erin Mikail Staples is a very online individual passionate about facilitating better connections online and off.  She’s forever thinking about how we can communicate, educate and elevate others. Currently, Erin works at Orbit and teaches at NYU. Most importantly, she firmly believes in the power of being unabashedly into things and works to help friends, strangers, colleagues, community builders, graduate students, and whoever else may cross her path find their thing."
      }
    ]
  },
  {
    "title": "Accessibility is Not a Mystery",
    "abstract": "If you think lack of accessibility on websites doesn’t or won’t impact you, think again. The harsh reality is that every single person is going to experience eyesight degeneration in their lifetime that will result in requiring the use of accessibility technologies. The reality is that accessible features are no longer just for edge cases, but for everyone. Not only is it ethically imperative to create technologies which promote an inclusive society that benefits all, accessibility has also become a legal requirement. \r\n\r\nThis talk with begin with an overview of why accessibility is considered a dark art and how to get started on the pathway of learning about it as a new developer. It will answer questions such as: what accessibility is in terms of web development, where to locate good learning resources, and how to begin implementing basic accessibility concepts into digital products. \r\n\r\nWe will then end with a high-level overview of the legal impact of web accessibility. With an overview of governing bodies of laws and regulations that determine what is considered compliant, what is legally required in the current landscape, how to use Chrome Dev tools to do a basic accessibility site audit, as well as how to stay informed, updated, and get involved in the rapidly evolving sector of being an accessible developer.\r\n",
    "format": "Talk",
    "track": "Beyond the Binary",
    "tags": [],
    "id": 20,
    "video_url": "",
    "slides_url": "",
    "speakers": [
      {
        "name": "Laurel Younis",
        "bio": "Laurel Younis is your inclusive software engineer \u0026 tech leader delivering high energy talks that challenge the audience to leverage their focus and pay attention to what matters most at work \u0026 in life. She brings practical strategy to the audience, enabling them to easily implement the techniques and advice given into their personal projects and professional lives. \r\nYounis’s background in software development, business consulting, and entrepreneurship enables her to connect with all audiences."
      }
    ]
  },
  {
    "title": "How I Tracked My Pregnancy with Python \u0026 Emojis",
    "abstract": "This is a talk about how I created my own pregnancy-tracking app. Not satisfied with the generic apps, I crafted my own using the power of Python3 and emoji!  My app uses the open-source Python web platform Anvil. Anvil’s drag-and-drop editor made it easy to create a beautiful, functional app driven by Python - without needing to learn CSS or Javascript. I'll walk you through how I put my app together and added custom links, a login portal, weekly email updates to my users and more. By the end you will be able to build your own version.\r\n\r\nTry out the app here! www.howpregnantami.com",
    "format": "Talk",
    "track": "Open Toolbox",
    "tags": [],
    "id": 31,
    "video_url": "",
    "slides_url": "",
    "speakers": [
      {
        "name": "Hannah Hazi",
        "bio": "I'm a software engineer based in Cambridge, UK. I got into software via a somewhat roundabout route - I originally wanted to become a civil engineer! I moved from engineering into 3D printing and then fell in love with Python \u0026 never looked back. I currently work at Anvil as a Developer Advocate, helping people build web apps with nothing but Python. In my spare time I love playing with Raspberry Pi and making art. My website is raspberrycheesecake.github.io"
      }
    ]
  }
]
